[
    {
        "moduleCode":"AA1201",
        "title":"Asian Challenges and Interconnections",
        "description":"This module introduces students to the study of Asia as a diverse, complex, and interconnected region within a globalised world. Focusing on contemporary political, economic, demographic, social, cultural and environmental challenges, the module explores their various historical roots, present impact, and future possibilities. This module lays important foundations in the interdisciplinary area studies approach, and questions key concepts (such as region, nation, migration, diaspora, culture, and even ‘Asia’) through comparative examinations of Asian sub-regions. This is the compulsory foundational module for the Minor in Asian Studies. This module is open to all NUS students.",
        "moduleCredit":"4",
        "department":"South Asian Studies",
        "faculty":"Arts and Social Science",
        "workload":[
            2,
            1,
            0,
            2,
            5
        ],
        "semesterData":[
            {
                "semester":1,
                "covidZones":[
                    "Unknown"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5001",
        "title":"Architectural History of Singapore",
        "description":"This module introduces the architectural history of Singapore from the pre-colonial era to the contemporary period from an interdisciplinary perspective. It explores the social and cultural role of architects, and to how that role has been interpreted and has evolved. It also offers critical views on the role of architecture in constructing the national identity of Singapore.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            2,
            1,
            0,
            5,
            2
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5002",
        "title":"Conservation Approaches and Philosophies",
        "description":"This module aims to introduce students to current conservation approaches such as Historic Urban Landscape, Heritage Impact Assessment, Conservation Management Plan, Historic Area Assessments approach and applications and their application and relevance in the Asian context. The focus will be to understand how and why these concepts and methods have evolved and applied in practice in the Singapore context. Students will be strongly encouraged to contextualise this with other international heritage conservation scenarios in the region and worldwide to reflect broader shifts in conservation approaches.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            2,
            0,
            7,
            0
        ],
        "semesterData":[
            {
                "semester":2,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5003",
        "title":"Urban Conservation and Regeneration",
        "description":"This module will equip students with a comprehensive understanding of the key theoretical debates, challenges, and practices of urban conservation and regeneration. In addition to examining the architectural issues, the module\nwill also investigate the social, economic and environmental problems which have resulted in current Asian urban and suburban landscapes, and how government policy can affect change to these landscapes for urban and economic renewal. By exploring exemplary examples mainly from Asia, students will critically discuss\nthe suitability, significance, and strategies employed to tackle emerging urban conservation and regeneration issues and challenges faced in the region.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            2,
            1,
            0,
            6,
            1
        ],
        "semesterData":[
            {
                "semester":2,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5004",
        "title":"Architectural Heritage Management",
        "description":"This module will introduce students to the history and concept of cultural heritage, fundamental heritage conservation approaches and their underlying ethics and\nphilosophies. This module will provide the students with an understanding of the idea of “heritage,” and multiplicity of meanings, values and priorities attributed to heritage; interpretation and politics of representation and the role of community in it; and the current debates and potential futures of architectural heritage planning and management in Singapore and the region.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            2,
            0,
            7,
            0
        ],
        "semesterData":[
            {
                "semester":2,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5005",
        "title":"Conservation Policy Methodology for Sustainable Development",
        "description":"The module spans built heritage and local traditional issues arising from contexts where sustainable land development and urban conservation are at issue. To understand the need for an integrated planning that includes conservation to preserve the character of the historic city, this module will critically analyze various existing tools to manage conservation and the need for change in an urban landscape. The module will focus on: the context of the Vienna Memorandum; the concept of historic urban landscapes; guidelines for the conservation of historic urban landscapes; and guidelines for the integration of contemporary architecture in historic urban landscapes.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            2,
            0,
            7,
            0
        ],
        "semesterData":[
            {
                "semester":2,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5006",
        "title":"Disaster Risk Management of Cultural Heritage",
        "description":"This module will provide the students with an understanding of three closely interlinked components: disaster risk management, cultural heritage management and urban planning and development. It will address the general principles of disaster risk management for cultural heritage. It will also provide focused learning for students to deal with various challenges related to disaster risk management of cultural heritage within their local context in particular, and Asian context in general.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            2,
            0,
            7,
            0
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5007",
        "title":"Dissertation",
        "description":"The dissertation is an opportunity for students to engage in a critical reflection on what they already know. It should be seen as an exciting venue to apply further research methods and critical thinking tools to extend their understanding of the various topics relevant to architecture as a discipline, especially about conservation.\n\nStudents will be encouraged to build upon and further develop the body of knowledge gained from their taught coursework, in a dissertation (a detailed written discourse of 8,500-10,000 words) under the guidance of assigned supervisors.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            0,
            1,
            0,
            9,
            0
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5008",
        "title":"Design for Conservation",
        "description":"This module will be a community-service-learning studio in which the students will work with private owners/authority representatives to programme and design buildings in Singapore. This design studio will emphasise the need for a community-oriented design process that is collaborative, inclusive, and shape ways of living for the entire community.",
        "moduleCredit":"8",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            6,
            0,
            1,
            12
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5009",
        "title":"Design for Adaptive Reuse",
        "description":"This design studio will focus on conservation and adaptive reuse of historic buildings. This studio will be an outstanding opportunity to overcome the gaps between theoretical approaches to and practice of heritage conservation in the context of national and international challenges. This module will assist students in understanding the heritage values and developing abilities for investigation, understanding, analysing, setting strategy for conservation and creative thinking methods through documentation and recording, urban rehabilitation, renovation, adaptive reuse, reconstruction, restoration, and in-fill projects.",
        "moduleCredit":"8",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            6,
            0,
            1,
            12
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5010",
        "title":"Historic Buildings Survey and Recording",
        "description":"This module will equip the students with the specialised skills required for researching, analysing and recording historic buildings. It will also familiarise them with current professional guidance on standards and reports, including desk-based assessments, historic building reports, condition assessments and heritage statements. Working on-site the students will gain experience in a range of survey and recording techniques such as rectified photography, photogrammetry and other 3D recording methods, CAD drawing and BIM for heritage.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            2,
            0,
            7,
            0
        ],
        "semesterData":[
            {
                "semester":2,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"AC5011",
        "title":"Conservation of C20th Buildings",
        "description":"The module reviews the existing knowledge about the conservation of C20th buildings in Singapore and region, SE Asia. The module will include an introduction to conservation principles, methodology, and technical solutions to deterioration and failure of C20th building materials such as concrete, new industrial materials (glass, plastic, composites) and building systems. Topics explored will also include the history of modern architecture, its associated technologies, and principles of modernist design. The module will conservation of the architecture of the recent past, heritage challenges posed by the architecture and technology of C20th buildings.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            2,
            1,
            0,
            5,
            2
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5012",
        "title":"Practical Building Conservation Skills I",
        "description":"Working with experienced conservation practitioners, the students will understand the principles and practices involved in conserving historic buildings and materials, mainly in Southeast Asia. The range of topics to be covered includes visual analysis, scientific investigation and understanding of materials, assessment of conservation needs, the range of remedial solutions relating to the use of traditional building materials, and hands-on experience to develop practical skills and techniques in lime mortars, plasters and renders, Shanghai plasterwork, masonry, terracotta, decorative plasterwork, and painted surfaces.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            0,
            0,
            9,
            0
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5013",
        "title":"Practical Building Conservation Skills II",
        "description":"Through lectures, site visits and working with experienced conservation practitioners, the students will gain knowledge and hands-on experience to develop repair techniques and strategies in timber, ferrous metal, tiles, stained glass, historic finishes and paintwork, and cleaning methods mainly used in Southeast Asia.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            1,
            0,
            0,
            9,
            0
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"AC5014",
        "title":"Internship",
        "description":"It aims to provide students with practical professional experience involving at least five weeks in heritage conservation sector either government or private. The hosting institution, in collaboration with the department, will define the work scope of students on internship.  Students are required to submit a project, the topic of which must be approved in advance, together with a 2,500-word report on the internship experience at the end of the work period. The student is required to spend three hours, three days per week for a total of five weeks at the hosting institution.",
        "moduleCredit":"4",
        "department":"Architecture",
        "faculty":"Design and Environment",
        "workload":[
            0,
            0,
            0,
            45,
            0
        ],
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC1002",
        "title":"Financial Accounting",
        "description":"The course provides an introduction to financial accounting. It examines accounting from an external user's perspective: an external user being an investor or a creditor. Such users would need to understand financial accounting in order to make investing or lending decisions. However, to attain a good understanding, it is also necessary to be familiar with how the information is derived. Therefore, students would learn how to prepare the reports or statements resulting from financial accounting and how to use them for decision-making.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            2,
            2,
            0,
            3,
            4
        ],
        "preclusion":"Students who have passed FNA1002 are not allowed to take ACC1002.",
        "attributes":{
            "su":true
        },
        "semesterData":[
            {
                "semester":1,
                "covidZones":[
                    "Unknown",
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B",
                    "Unknown"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC1002X",
        "title":"Financial Accounting",
        "description":"The course provides an introduction to financial accounting. It examines accounting from an external user's perspective: an external user being an investor or a creditor. Such users would need to understand financial accounting in order to make investing or lending decisions. However, to attain a good understanding, it is also necessary to be familiar with how the information are derived. Therefore, students would learn how to prepare the reports or statements resulting from financial accounting and how to use them for decision-making.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "preclusion":"Students who have passed CS1304 or EC3212 or BK1003 or BZ1002 or BH1002 or BZ1002E or BH1002E or FNA1002E or FNA1002X are not allowed to take ACC1002X.",
        "attributes":{
            "su":true
        },
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-23T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "Unknown"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B",
                    "Unknown"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC1006",
        "title":"Accounting Information Systems",
        "description":"This course aims to help students understand the role of information systems in accounting and other areas of business. \n\nIn particular, it examines the innovative applications of information systems to streamline business operations and enhance competitive advantage. \n\nStudents will understand various accounting/business cycles and learn about how information systems are used in different functional areas such as finance/accounting, marketing, operations and supply chain, and HR/management.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            0,
            3,
            0,
            4,
            3
        ],
        "prerequisite":"FNA1002 or ACC1002",
        "preclusion":"Students who have passed FNA1006 are not allowed to take ACC1006.",
        "attributes":{
            "su":true
        },
        "semesterData":[
            {
                "semester":2,
                "examDate":"2021-04-28T05:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC1701",
        "title":"Accounting for Decision Makers",
        "description":"The course provides an introduction to accounting from a user perspective. Financial reporting is covered from the viewpoint of an external investor. The focus is on how accounting can help investors make better decisions. Book-keeping and preparation of financial statements are also covered at an introductory level, as investors need to be aware of how the financial statements are derived.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            2,
            1,
            0,
            4,
            3
        ],
        "preclusion":"ACC1002; ACC1002X; EC2204",
        "attributes":{
            "su":true,
            "sfs":true,
            "ssgf":true
        },
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-23T09:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "Unknown",
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B",
                    "Unknown"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC1701X",
        "title":"Accounting for Decision Makers",
        "description":"The course provides an introduction to accounting from a user perspective. Financial reporting is covered from the viewpoint of an external investor. The focus is on how accounting can help investors make better decisions. Book-keeping and preparation of financial statements are also covered at an introductory level, as investors need to be aware of how the financial statements are derived.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            2,
            1,
            0,
            4,
            3
        ],
        "preclusion":"ACC1002; ACC1002X",
        "attributes":{
            "su":true,
            "ssgf":true
        },
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-23T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "Unknown"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B",
                    "Unknown"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC2002",
        "title":"Managerial Accounting",
        "description":"This course covers major concepts, tools and techniques in managerial accounting. It provides students with an appreciation of how managerial accounting evolves with changes in the business environment and why the usefulness of managerial accounting systems depends on the organisational context. The emphasis is on the use of managerial accounting information for decision-making, planning, and controlling activities. Students are introduced to both traditional and contemporary managerial accounting concepts and techniques.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            2,
            2,
            0,
            3,
            4
        ],
        "prerequisite":"Students must have completed BK1003 or BZ1002 or BH1002 or FNA1002 or FNA1002X or FNA1002E or ACC1002 or ACC1002X or BH1002E or CS1304 or EC3212 or EG1422 before they are allowed to take ACC2002.",
        "preclusion":"BH2002 or BZ3102 or BK2001  or FNA2002 or IE4242",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-12-02T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-05-05T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC2706",
        "title":"Managerial Accounting",
        "description":"This course covers major concepts, tools and techniques in managerial accounting. It provides students with an appreciation of how managerial accounting evolves with changes in the business environment and why the usefulness of managerial accounting systems depends on the organisational context. The emphasis is on the use of managerial accounting information for decision-making, planning, and controlling activities. Students are introduced to both traditional and contemporary managerial accounting concepts and techniques.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            0,
            3,
            0,
            3,
            4
        ],
        "prerequisite":"ACC1701/ACC1701X or EC2204",
        "preclusion":"ACC2002",
        "attributes":{
            "ssgf":true
        },
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-12-02T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-05-05T09:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC2707",
        "title":"Corporate Accounting & Reporting I",
        "description":"The module covers financial accounting at an intermediate level, with special reference to accounting for property, plant & equipment, investment properties, assets held for sale, intangible assets, asset impairment, changes in accounting policies and estimates, post-balance-sheet events, revenue accounting, segment reporting and interim reporting.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            0,
            3,
            0,
            4,
            3
        ],
        "prerequisite":"ACC1701/ACC1701X or EC2204.\n(or AC1002 or ACC1002X)",
        "preclusion":"ACC3601",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-21T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-05-03T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC2708",
        "title":"Corporate Accounting & Reporting II",
        "description":"The module covers financial accounting at an intermediate level, with special reference to accounting for financial instruments, deferred tax, leases, provisions, employee benefits, and share-based compensation.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            0,
            3,
            0,
            4,
            3
        ],
        "prerequisite":"ACC2707",
        "preclusion":"ACC3601",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-28T01:00:00.000Z",
                "examDuration":150,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-30T06:30:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC2709",
        "title":"Accounting Information Systems",
        "description":"This course aims to help students understand the role of information systems in accounting and other areas of business. \n\nIn particular, it examines the innovative applications of information systems to streamline business operations and enhance competitive advantage. \n\nStudents will understand various accounting/business cycles and learn about how information systems are used in different functional areas such as finance/accounting, marketing, operations and supply chain, and HR/management.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            0,
            3,
            0,
            4,
            3
        ],
        "prerequisite":"ACC1701/ACC1701X or EC2204",
        "preclusion":"ACC1006",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-26T01:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-28T05:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC3601",
        "title":"Corporate Accounting and Reporting",
        "description":"This course examines the conceptual and theoretical issues underlying the corporate accounting and reporting requirements under the US, International and Singapore Accounting Standards. This allows the students to understand the economic rationales behind the accounting treatment of major financial statement items. It also equips the students with skills in using financial information for decision-making. Topics to be covered include conceptual framework in financial reporting, accounting for foreign currency translation, leasing, preparation of consolidated financial statements, earnings quality management and off-balance sheet financing.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            4,
            4
        ],
        "prerequisite":"FNA1002 or ACC1002",
        "preclusion":"BH3111 or BZ3101 or BK3106 or FNA3111",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3602",
        "title":"Managerial Planning and Control",
        "description":"The course examines various means by which control can be exercised and the types of accounting information that allow for different means of control. Topics to be covered include the nature of control, responsibility centers, economic value added, transfer pricing, strategic planning, budgeting, performance evaluation systems, executive compensation, control for differentiated strategies, control for multinational organisations. Students learn how control is exercised through case analyses, case presentations and in-class discussions. The case approach makes control &quot;come alive&quot; for the students with descriptions of control at various real organisations. The case presentations make the students think critically and strategically. The in-class discussions allow the students to evaluate the pros and cons of different approaches and solutions to control problems.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            4,
            4
        ],
        "prerequisite":"FNA2002 or ACC2002",
        "preclusion":"Students who have passed FNA3112 are not allowed to take ACC3602.",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3603",
        "title":"Assurance and Attestation",
        "description":"This module provides the knowledge and understanding of the audit process required by assurance and attestation engagements. It aims to ensure students acquire the necessary attitude, skills, and knowledge for a career in auditing, in the accounting profession or in business management.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA1002/ACC1002 and FNA2002 (Students who are not enrolled in the accounting or accounting-specialization program should seek Deans Office permission to read the module)",
        "preclusion":"Students who have passed FNA3121 are not allowed to take ACC3603.",
        "semesterData":[
            {
                "semester":1,
                "covidZones":[
                    "B",
                    "Unknown"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-05-06T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC3604",
        "title":"Corporate and Securities Law",
        "description":"The primary aim of this course is to develop a solid understanding of the legal framework required in the operations of business entities especially companies. It covers the entire life-span of a business entity, namely from the formation of the entity to its liquidation. It also includes the various legal obligations and implications in operating the business entity. A secondary objective is to introduce the pertinent provisions of securities legislation such as the Securities &amp; Futures Act and the Takeover Code.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"BSP1004",
        "preclusion":"Students who have passed FNA3122 or LL4055 are not allowed to take ACC3604.",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-26T09:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T05:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC3605",
        "title":"Taxation",
        "description":"This module introduces students to the basic concepts of income taxation in Singapore. Since a large portion of a business organisation's profits goes towards the payment of income tax, it is absolutely crucial for students to have an understanding of how tax works and how to legally minimize it. This module is relevant to those who wish to work in the fields of accounting, consulting or financial management.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA1002/ACC1002 and BSP1004",
        "preclusion":"Students who have passed FNA3127 or LL4056 are not allowed to take ACC3605.",
        "semesterData":[
            {
                "semester":1,
                "covidZones":[
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-26T01:00:00.000Z",
                "examDuration":180,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC3606",
        "title":"Advanced Corporate Accounting and Reporting",
        "description":"This course explores in greater depth complex financial reporting topics introduced in \n\nACC1002 Financial Accounting and ACC3601 Corporate Accounting and Reporting, and it also examines issues relating to fair value accounting. The viewpoint is that of the preparer of financial statements. The discussion centres on the financial reporting issues affecting a firm's profitability and risk. This course is for students who expect to become CPAs.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA3111 or ACC3601",
        "preclusion":"Students who have passed FNA3123 are not allowed to take ACC3606.",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3611",
        "title":"Corporate Governance and Ethics",
        "description":"Corporate governance has been defined to involve &quot;a set of relationships between a company's management, its board, its shareholders and other stakeholders [and that which] provides the structure through which the objectives of the company are set, and the means of attaining those objectives and monitoring performance are determined&quot; (OECD Principles of Corporate Governance, 2004). This module covers corporate governance from a multidisciplinary perspective, including law, finance, accounting and economics, and discusses ethical dilemmas and challenges faced by managers and employees and how these can be addressed.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA1002/ACC1002 and BSP1004",
        "preclusion":"Students who have passed FNA3124 or LL4065 are not allowed to take ACC3611.",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3612",
        "title":"Risk Management and Internal Control",
        "description":"To provide students with the ability and competency to exercise judgement and apply techniques in risk management to matters encountered by accounting professionals at the \n\norganisational level and to react to current developments or new practices. This module covers risk management frameworks, risk management techniques and basic components of a business continuity plan.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA2004/FIN2004 and BSP1004",
        "preclusion":"Students who have passed FNA3125 are not allowed to take ACC3612.",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3613",
        "title":"Advanced Assurance and Attestation",
        "description":"To equip students with a good understanding of the theoretical and practical knowledge/techniques for a variety of assurance and attestation work other than the statutory audit. Such work is often more complex and requires advanced methodologies.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA3121 or ACC3603",
        "preclusion":"Students who have passed FNA3128 are not allowed to take ACC3613.",
        "semesterData":[

        ]
    },
    {
        "moduleCode":"ACC3614",
        "title":"Valuation",
        "description":"This module equips students with an understanding of the various valuation issues and methodologies available to accountants and managers. It specifically discusses valuation issues pertaining to the enterprise, assets for use, and liabilities. After taking this course, the students should be able to value certain classes of assets and liabilities which are of significant interest and importance to the modern business. Coverage includes fair value and value-in-use concepts, earnings multiple analysis, discounted cash flow analysis and real option analysis.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA2004 or FIN2004",
        "preclusion":"Students who have passed FNA3126 are not allowed to take ACC3614.",
        "semesterData":[
            {
                "semester":1,
                "examDate":"2020-11-24T01:00:00.000Z",
                "examDuration":120,
                "covidZones":[
                    "Unknown",
                    "B"
                ]
            },
            {
                "semester":2,
                "examDate":"2021-04-29T01:00:00.000Z",
                "examDuration":150,
                "covidZones":[
                    "B"
                ]
            }
        ]
    },
    {
        "moduleCode":"ACC3615",
        "title":"Accounting Theory",
        "description":"Accounting theory is a body of rules and theories which governs the practice of financial accounting. Many of the rules and theories are well reasoned economic rationales and tested over time. On the other hand, the state of accounting theory also changes as new accounting and financial transactions are created in the new economy. This module seeks to examine some of the core theories that underpin financial accounting. This is essential to a proper theoretical understanding of the discipline of financial accounting.",
        "moduleCredit":"4",
        "department":"Accounting",
        "faculty":"NUS Business School",
        "workload":[
            3,
            1,
            0,
            3,
            6
        ],
        "prerequisite":"FNA3111/ACC3601\nCo-requisite: FNA3123/ACC3606",
        "preclusion":"Students who have passed FNA3129 are not allowed to take ACC3615.",
        "semesterData":[

        ]
    }
]